In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
print("Imported successfully")

Imported successfully

In [2]:

sales = pd.read_excel("electronic_sales.xlsx")
sales.head()

        Date Branch Sales Agent Products  Units   Price
0 2014-09-01   Woji     Chinedu    Apple      2  125.00
1 2015-06-17   Woji       Emeka    Apple      5  125.00
2 2015-09-10   Woji     Ibrahim   Lenovo      7    1.29
3 2015-11-17   Woji        Tolu       HP     11    4.99
4 2015-10-31   Woji       Tonye   Lenovo     14    1.29

In [3]:
# Do a little bit of feature engineering
#Add revenue column
# To create a new column, you start with creating the new columns as a variable name
# units X price = Revenue
# units * price = Revenue
sales["Revenue"] = sales["Units"] * sales["Price"]


# round(parameter, 2)
sales["Revenue(N)"] = round(sales["Units"]*sales["Price"] * 1000,2)
sales.head()

        Date Branch Sales Agent Products  Units   Price  Revenue  Revenue(N)
0 2014-09-01   Woji     Chinedu    Apple      2  125.00   250.00    250000.0
1 2015-06-17   Woji       Emeka    Apple      5  125.00   625.00    625000.0
2 2015-09-10   Woji     Ibrahim   Lenovo      7    1.29     9.03      9030.0
3 2015-11-17   Woji        Tolu       HP     11    4.99    54.89     54890.0
4 2015-10-31   Woji       Tonye   Lenovo     14    1.29    18.06     18060.0

In [4]:
sales.dtypes

Date           datetime64[ns]
Branch                 object
Sales Agent            object
Products               object
Units                   int64
Price                 float64
Revenue               float64
Revenue(N)            float64
dtype: object

In [5]:
# let's convert the date column to datetime
# Using "pd.to_datetime()" function

#to_datetime()
#datetime()
sales["Date"] = pd.to_datetime(sales["Date"])

In [6]:
sales.head()

        Date Branch Sales Agent Products  Units   Price  Revenue  Revenue(N)
0 2014-09-01   Woji     Chinedu    Apple      2  125.00   250.00    250000.0
1 2015-06-17   Woji       Emeka    Apple      5  125.00   625.00    625000.0
2 2015-09-10   Woji     Ibrahim   Lenovo      7    1.29     9.03      9030.0
3 2015-11-17   Woji        Tolu       HP     11    4.99    54.89     54890.0
4 2015-10-31   Woji       Tonye   Lenovo     14    1.29    18.06     18060.0

In [7]:
# let's do more feature engineering
# let's work on our datetime to extract the month , year and week name
#Using ".dt.year", ".dt.month_name()", ".day_name()"

sales["Year"] = sales["Date"].dt.year
sales["Month"] = sales["Date"].dt.month_name()
sales["Week"] = sales["Date"].dt.day_name()

In [8]:
sales.head()

,Date,Branch,Sales Agent,Products,Units,Price,Revenue,Revenue(N),Year,Month,Week
0,2014-09-01,Woji,Chinedu,Apple,2,125.00,250.00,250000.0,2014,September,Monday
1,2015-06-17,Woji,Emeka,Apple,5,125.00,625.00,625000.0,2015,June,Wednesday
2,2015-09-10,Woji,Ibrahim,Lenovo,7,1.29,9.03,9030.0,2015,September,Thursday
3,2015-11-17,Woji,Tolu,HP,11,4.99,54.89,54890.0,2015,November,Tuesday
4,2015-10-31,Woji,Tonye,Lenovo,14,1.29,18.06,18060.0,2015,October,Saturday

In [9]:
# Total units sold
Total_goods_sold = sales["Units"].sum()
print(f"Total goods sold: {Total_goods_sold} units")

Total goods sold: 2121 units

In [10]:
#Total Revenue
Total_Revenue = sales["Revenue(N)"].sum()
print(f"Total Revenue: N{Total_Revenue}")

Total Revenue: N19627880.0

In [11]:
#Average Revenue per unit
# Using "round() function to approximate to 3 decimal place"
Average_Revenue_per_unit = round(Total_Revenue / Total_goods_sold,2)
print(f"Average Revenue per unit: N{Average_Revenue_per_unit}")

Average Revenue per unit: N9254.07

In [12]:
# Numbers of products
# Using .nunuque() shows the numbers of unique values
Numbers_of_products = sales["Products"].nunique()
print(f"Numbers of products: {Numbers_of_products}")

Numbers of products: 5

In [21]:
#Numbers of products sold by each agent
Numbers_of_products_by_each_agent = sales["Sales Agents"].nunique()

KeyError: 'Sales Agents'

In [25]:
# Numbers of Sales Agents
Numbers_of_sales_agents = sales["Sales Agent"].nunique()
print(f"Numbers of Sales Agents: {Numbers_of_sales_agents}")

Numbers of Sales Agents: 11

In [26]:
sales.set_index("Date", inplace=True)